[
  {
    "image": "https://i.ibb.co/ynRKGr7/aapartment.jpg",
    "estate_title": "Beachfront Condo",
    "id": "003",
    "segment": "Condominiums",
    "description": "Nestled along the pristine shores of a coastal city in State A, this beachfront condo offers a luxurious retreat with unparalleled ocean views. As you step onto the private balcony, the sound of waves crashing against the shore serenades you, creating a tranquil ambiance that embodies seaside living at its finest. With 1800 square feet of impeccably designed living space, this residence boasts four bedrooms and three bathrooms, providing ample space for relaxation and entertainment. The interior exudes sophistication, featuring high-end finishes and contemporary decor that complement the natural beauty of the surroundings. Residents enjoy exclusive access to a private beach, perfect for leisurely strolls or basking in the sun. Additionally, the building offers amenities such as a fitness center and concierge service, ensuring a lifestyle of convenience and comfort. Whether you're seeking a permanent residence or a vacation getaway, this beachfront condo offers the epitome of coastal living, where every day feels like a retreat.",
    "price": "$2,500,000",
    "status": "sale",
    "area": "1800 sq ft",
    "location": "Coastal City, State A",
    "facilities": [
      "private beach access",
      "fitness center",
      "concierge service"
    ],
    "bedroom": "4",
    "bathroom": "3",
    "garage": "2",
    "coordinate": [34.4054, -119.694]
  },
  {
    "image": "https://i.ibb.co/PxsJwyM/room.jpg",
    "estate_title": "Suburban Family Home",
    "id": "004",
    "segment": "Single-family homes",
    "description": "Situated in the peaceful suburbs of State B, this spacious family home offers an idyllic retreat from the hustle and bustle of city life. Boasting 2200 square feet of living space, this residence features four bedrooms and three bathrooms, providing ample space for the whole family. The heart of the home is the expansive backyard, perfect for outdoor gatherings and recreational activities. Inside, the home exudes warmth and comfort, with a finished basement providing additional living space and the in-ground pool offering a refreshing oasis during the summer months. With a two-car garage providing convenient parking and storage, this suburban oasis offers the perfect blend of comfort and convenience. Whether you're relaxing indoors or enjoying the tranquility of the outdoors, this suburban family home provides the ideal setting for creating lasting memories with loved ones.",
    "price": "$450,000",
    "status": "sale",
    "area": "2200 sq ft",
    "location": "Suburban Town, State B",
    "facilities": ["finished basement", "in-ground pool", "2-car garage"],
    "bedroom": "4",
    "bathroom": "3",
    "garage": "2",
    "coordinate": [33.985, -118.4695]
  },
  {
    "image": "https://i.ibb.co/hccPB4r/live.jpg",
    "estate_title": "Downtown Loft",
    "id": "005",
    "segment": "Apartments",
    "description": "Located in the vibrant heart of City C, this charming loft-style apartment offers a unique blend of urban living and historic charm. Boasting 1100 square feet of open-concept living space, this residence features exposed brick walls and high ceilings, creating a stylish and inviting atmosphere. The gourmet kitchen is a chef's dream, equipped with modern appliances and ample counter space for culinary creations. Step outside onto the private rooftop terrace and soak in panoramic views of the city skyline, the perfect backdrop for entertaining guests or enjoying a quiet evening under the stars. With amenities such as an open floor plan and rooftop terrace, this downtown loft offers the ultimate urban lifestyle in one of the city's most desirable neighborhoods.",
    "price": "$2,200/month",
    "status": "rent",
    "area": "1100 sq ft",
    "location": "Downtown, City C",
    "facilities": ["open floor plan", "gourmet kitchen", "rooftop terrace"],
    "bedroom": "4",
    "bathroom": "3",
    "garage": "2",
    "coordinate": [34.0522, -118.2437]
  },
  {
    "image": "https://i.ibb.co/Fbv2tpd/kitchen.jpg",
    "estate_title": "Luxury Townhouse",
    "id": "006",
    "segment": "Townhouses",
    "description": "Embrace the epitome of luxury living in this elegant townhouse located in the prestigious neighborhood of State D. Boasting 2800 square feet of meticulously designed living space, this residence features high-end finishes and sophisticated touches throughout. The gourmet kitchen is a chef's dream, equipped with top-of-the-line appliances and custom cabinetry. Step outside onto the rooftop deck and take in sweeping views of the surrounding area, the perfect setting for entertaining guests or enjoying a quiet evening at home. With a private garage providing secure parking and storage, this townhouse offers the perfect combination of style and convenience. Whether you're relaxing indoors or hosting gatherings with friends and family, this luxury townhouse provides an unparalleled living experience in one of the most sought-after neighborhoods.",
    "price": "$800,000",
    "status": "sale",
    "area": "2800 sq ft",
    "location": "Upscale Suburb, State D",
    "facilities": ["private garage", "rooftop deck", "gourmet kitchen"],
    "bedroom": "4",
    "bathroom": "3",
    "garage": "2",
    "coordinate": [33.7223, -118.0027]
  },
  {
    "image": "https://i.ibb.co/hLWMcVy/belcony.jpg",
    "estate_title": "Historic Farmhouse",
    "id": "007",
    "segment": "Single-family homes",
    "description": "Step back in time and experience the charm of yesteryear in this historic farmhouse located in the rural countryside of State E. Situated on expansive acreage, this charming residence offers 3500 square feet of living space and features original architectural details throughout. The large porch is the perfect spot to enjoy a morning cup of coffee or watch the sunset over the rolling hills. With a detached barn and mature orchard on the property, there's plenty of space for hobbies and outdoor activities. Whether you're seeking a peaceful retreat or a place to call home, this historic farmhouse offers a unique opportunity to own a piece of history in the picturesque countryside.",
    "price": "$650,000",
    "status": "sale",
    "area": "3500 sq ft",
    "location": "Rural County, State E",
    "facilities": ["detached barn", "large porch", "mature orchard"],
    "bedroom": "4",
    "bathroom": "3",
    "garage": "2",
    "coordinate": [38.0902, -122.391]
  },
  {
    "image": "https://i.ibb.co/9GpP820/homeee.jpg",
    "estate_title": "Luxury Penthouse",
    "id": "008",
    "segment": "Apartments",
    "description": "Perched high above the bustling skyline of City F, this stunning penthouse offers unrivaled luxury and sophistication. Boasting 2200 square feet of impeccably designed living space, this residence features floor-to-ceiling windows that frame panoramic views of the city below. The private elevator whisks you away to your own personal oasis, where you'll find high-end finishes and designer touches throughout. Step outside onto the expansive rooftop terrace and indulge in al fresco dining or simply relax and take in the breathtaking views. With amenities such as a rooftop terrace and butler service, this luxury penthouse offers the ultimate urban retreat for those with discerning tastes.",
    "price": "$5,000/month",
    "status": "rent",
    "area": "2200 sq ft",
    "location": "Downtown Skyline, City F",
    "facilities": ["private elevator", "rooftop terrace", "butler service"],
    "bedroom": "4",
    "bathroom": "3",
    "garage": "2",
    "coordinate": [34.0407, -118.2468]
  },
  {
    "image": "https://i.ibb.co/186pB0c/home.jpg",
    "estate_title": "Waterfront Cottage",
    "id": "009",
    "segment": "Single-family homes",
    "description": "Escape to your own private oasis in this charming waterfront cottage located in the tranquil Lakeside Community of State G. Nestled along the shores of a pristine lake, this residence offers 1800 square feet of cozy living space and features breathtaking water views from every room. The private beach and boat house provide endless opportunities for water recreation, while the outdoor firepit is the perfect spot for gathering with friends and family on cool evenings. With amenities such as a private beach and outdoor firepit, this waterfront cottage offers the perfect blend of relaxation and recreation for those seeking a retreat from the everyday hustle and bustle.",
    "price": "$375,000",
    "status": "sale",
    "area": "1800 sq ft",
    "location": "Lakeside Community, State G",
    "facilities": ["private beach", "boat house", "outdoor firepit"],
    "bedroom": "4",
    "bathroom": "3",
    "garage": "2",
    "coordinate": [35.5669, -120.762]
  },
  {
    "image": "https://i.ibb.co/QmrZTNJ/bed.jpg",
    "estate_title": "Urban Loft Apartment",
    "id": "010",
    "segment": "Apartments",
    "description": "Immerse yourself in the vibrant energy of City H in this stylish urban loft apartment located in the trendy neighborhood. Boasting 1400 square feet of industrial-chic design, this residence features exposed brick walls and expansive windows that offer sweeping views of the city skyline. The open floor plan creates a sense of spaciousness, perfect for modern living and entertaining. Step outside onto the rooftop communal space and enjoy panoramic views of the city below, the perfect setting for social gatherings or quiet moments of relaxation. With amenities such as exposed brick walls and rooftop communal space, this urban loft apartment offers a unique opportunity to experience city living at its finest.",
    "price": "$2,800/month",
    "status": "rent",
    "area": "1400 sq ft",
    "location": "Trendy Neighborhood, City H",
    "facilities": [
      "open floor plan",
      "exposed brick walls",
      "rooftop communal space"
    ],
    "bedroom": "4",
    "bathroom": "3",
    "garage": "2",
    "coordinate": [34.0522, -118.2437]
  },
  {
    "image": "https://i.ibb.co/ynRKGr7/aapartment.jpg",
    "estate_title": "Luxury Countryside Estate",
    "id": "011",
    "segment": "Single-family homes",
    "description": "Escape the hustle and bustle of the city and retreat to this expansive countryside estate located in the scenic rural region of State I. Spread across 6000 square feet of living space, this residence offers unparalleled privacy and tranquility, surrounded by rolling hills and lush greenery. The private vineyard provides a picturesque backdrop for outdoor gatherings, while the resort-style amenities, including an indoor pool and horse stables, offer endless opportunities for recreation and relaxation. With amenities such as a private wine cellar and indoor pool, this countryside estate offers the perfect blend of luxury and serenity for those seeking a retreat from the demands of modern life.",
    "price": "$4,500,000",
    "status": "sale",
    "area": "6000 sq ft",
    "location": "Scenic Rural Region, State I",
    "facilities": ["private wine cellar", "indoor pool", "horse stables"],
    "bedroom": "4",
    "bathroom": "3",
    "garage": "2",
    "coordinate": [38.5816, -121.4944]
  }
]
